VALID_REACTIONS = {
    "❤️", "👍", "👎", "🔥", "🥰", "👏", "😁", "🤔", "🤯", "😱",
    "🤬", "😢", "🎉", "🤩", "🆒", "🤮", "💩", "🙏", "👌", "🕊",
    "🤡", "🥱", "🥴", "😍", "🐳", "❤️‍🔥", "🌚", "🌭", "💯", "🤣",
    "⚡️", "🍌", "🏆", "💔", "🤨", "🍓", "🍾", "💋", "🖕",
    "😈", "😴", "😭", "🤓", "👻", "🧑‍💻", "👀", "🎃", "🙈", "😇",
    "😨", "🤝", "✍️", "🤗", "🫡", "🎅", "🎄", "☃️", "💅", "🤪",
    "🗿", "💘", "🙉", "🦄", "😘", "💊", "🙊", "😎", "👾", "🤷‍♂️",
    "🤷", "🤷‍♀️", "😡"
}


async def is_valid_reaction(emoji: str) -> bool:
    """
    Проверяет, является ли переданный emoji допустимой реакцией Telegram.
    Возвращает True/False.
    """
    if not emoji or len(emoji.strip()) == 0:
        return False
    return emoji in VALID_REACTIONS